cases/forwardStep/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 3 0 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 3 0 0 );
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform ( 3 0 0 );
        value           uniform ( 3 0 0 );
    }
    bottom
    {
        type            symmetryPlane;
    }
    top
    {
        type            symmetryPlane;
    }
    obstacle
    {
        type            slip;
    }
    defaultFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
